Reports/СостояниеПроекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>СостояниеПроекта</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/ДатыКомплекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДатыКомплекта</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>БезГабаритногоЧертежа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БезЗамера</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГантКонструктораНачалоПКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГантКонструктораНачалоРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГантКонструктораОкончаниеПКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГантКонструктораОкончаниеРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГОСТ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДнейПКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДнейРКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДнейТЗ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КатегорияКонструктора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Код_в_PDM</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КрайПКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КрайРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КрайТЗ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоПКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоТЗ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерДоработка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерИзменение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерКорректировка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерПКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерРКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаВремени_ПКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаВремени_РКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаВремени_ТЗ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеПКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеТЗ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РКД_отдельно_от_композиции</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СогласованДизайнером</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокМонтажа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокПроектирования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокПроизводства</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКомплекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыКомплектов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоДоработка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоРекламация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Комплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыЗамера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыЗамера</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Изменения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проектный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рабочий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Строительный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/СостояниеПроекта/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	СформироватьОтчетНаСервере();
КонецПроцедуры 

&НаКлиенте
Процедура Обновить(Команда)
	СформироватьОтчетНаСервере();
КонецПроцедуры

Процедура СформироватьОтчетНаСервере()
	
	ПолеВывода.Очистить();
	
	Если Не ЗначениеЗаполнено(Проекты) Тогда
		Возврат;	
	КонецЕсли;
	
	стТаблицы 	= ПолучитьТаблицуДанных();
	
	ВывестиДанные(стТаблицы);
	
КонецПроцедуры // СформироватьОтчетНаСервере()

Функция ПолучитьТаблицуДанных()

	тзДанныеЗапрос 	= ЗаполнитьКомплектыИзделий();
	
	тзДанные = РассчитатьПоля(тзДанныеЗапрос);
	
	Возврат Новый Структура("тзДанные", тзДанные);
	
КонецФункции // ПолучитьТаблицуДанных()     

Функция РассчитатьПоля(тзДанныеЗапрос) 
	
	ТипСтрока = Новый ОписаниеТипов("Строка");
	
	тзДанные = Новый ТаблицаЗначений;
	//тзДанные.Колонки.Добавить("Проект"); 
	тзДанные.Колонки.Добавить("ПроектНаименование", ТипСтрока);
	тзДанные.Колонки.Добавить("Номер");
    тзДанные.Колонки.Добавить("КомплектКомпозиция");
    тзДанные.Колонки.Добавить("ИзделиеЗаказчика", ТипСтрока);
    тзДанные.Колонки.Добавить("КомплектКомпозицияНаименование", ТипСтрока);
    тзДанные.Колонки.Добавить("Помещение");
    тзДанные.Колонки.Добавить("ПомещениеНаименование", ТипСтрока);
    тзДанные.Колонки.Добавить("СтатусПомещения");
    тзДанные.Колонки.Добавить("ГабаритныйЧертеж");
    тзДанные.Колонки.Добавить("Согласовано");
    тзДанные.Колонки.Добавить("Приоритет");
    тзДанные.Колонки.Добавить("Состояние");
    тзДанные.Колонки.Добавить("Запас");
    тзДанные.Колонки.Добавить("КрайТЗ");
    тзДанные.Колонки.Добавить("КрайСогласования");
    тзДанные.Колонки.Добавить("КрайПроектирование");
    тзДанные.Колонки.Добавить("КрайПроизводство");
    тзДанные.Колонки.Добавить("КрайРКД");
    тзДанные.Колонки.Добавить("КрайМонтаж");
    тзДанные.Колонки.Добавить("Договор");
    тзДанные.Колонки.Добавить("Редакция");
    тзДанные.Колонки.Добавить("ЭтоКомпозиция");
    тзДанные.Колонки.Добавить("ОсновнойЭтап");
	
	НомерКомпозиции 	= 0;
	Номер			 	= 1; 
	
	мКомплект 			= Новый Массив;
	мИзделиеКомплект 	= Новый Массив;
	
	ТД 						= НачалоДня(ТекущаяДата());
	КоличествоСекундВДне 	= 3600 * 24;
	
	текущаяКомпозиция 	= Неопределено;
	текущийПроект 		= Неопределено;
	//мГабаритныеЧертежи	= Новый Массив; 
	
	Для каждого х Из тзДанныеЗапрос Цикл  
		
		Если НЕ текущийПроект = х.Проект  Тогда
			
			НС = тзДанные.Добавить();
			НС.ПроектНаименование = Строка(х.ПроектНомер) + " " + х.ПроектНаименование; 
			текущийПроект = х.Проект; 
			Номер = 1;  
			
		КонецЕсли;

		Если НЕ текущаяКомпозиция = х.Композиция И ЗначениеЗаполнено(х.Композиция) Тогда
			
			Номер = 1;  
			
			НС = тзДанные.Добавить();
			
			НомерКомпозиции 					= НомерКомпозиции + 1;
			текущаяКомпозиция 					= х.Композиция;	
			НС.Номер 							= НомерКомпозиции;
			НС.КомплектКомпозиция 				= х.Композиция;
			НС.КомплектКомпозицияНаименование 	= х.КомпозицииНаименование;
			НС.Помещение 						= х.ПомещениеКомпозиции;
			//НС.ПомещениеНаименование		 	= х.ПомещениеКомпозицииНаименование + "/ " + х.ГабаритныйЧертежКомпозицииНаименование;
			НС.ПомещениеНаименование		 	= х.ПомещениеКомпозицииНаименование;
			НС.Приоритет 						= х.ПриоритетКомпозиция;
			НС.Состояние		 				= х.ТекущаяСтадияКомпозиция;
			НС.КрайПроектирование 				= х.ВнешняяДатаОкончаниеПроектированияКомпозиции;
			НС.КрайПроизводство 				= х.ВнешняяДатаОкончаниеПроизводства;
			НС.КрайТЗ 							= х.ВнешняяДатаОкончаниеТЗКомпозиции;
			НС.КрайСогласования 				= х.ВнешняяДатаОкончаниеСогласованияКомпозиции;
			НС.КрайМонтаж 						= х.ВнешняяДатаОкончаниеМонтажа;
			НС.ОсновнойЭтап			 			= х.ОсновнойЭтапКомпозиции;
			НС.Редакция							= х.ПереходРедакцияКомпозиции;
			НС.ГабаритныйЧертеж					= х.ГабаритныйЧертежКомпозиции;
			НС.ЭтоКомпозиция					= Истина; 
			
			Если НС.ОсновнойЭтап = Перечисления.ОсновныеЭтапы.ПКД И х.ПереходРедакция > 0 Тогда
				НС.Состояние = "Согласование." + (х.ПереходРедакция + 1);
				НС.Запас = Окр((НС.КрайСогласования - ТД) / КоличествоСекундВДне, 0);
			ИначеЕсли (НС.ОсновнойЭтап = Перечисления.ОсновныеЭтапы.ПКД 
				ИЛИ НС.ОсновнойЭтап = Перечисления.ОсновныеЭтапы.Согласование) И ЗначениеЗаполнено(НС.КрайПроектирование) Тогда
				НС.Запас = Окр((НС.КрайПроектирование - ТД) / КоличествоСекундВДне, 0);
			Иначе
				НС.Запас = "";                                                                                            		
			КонецЕсли;
			
			//Если ЗначениеЗаполнено(х.ГабаритныйЧертежКомпозиции) И мГабаритныеЧертежи.Найти(х.ГабаритныйЧертежКомпозиции) = Неопределено Тогда
			//	мГабаритныеЧертежи.Добавить(х.ГабаритныйЧертежКомпозиции);
			//КонецЕсли;
			//
			мКомплект.Добавить(х.Композиция);
			
		КонецЕсли;
		
		НС = тзДанные.Добавить();
		
		Если ЗначениеЗаполнено(х.Композиция) Тогда
			НС.Номер 							=  Строка(НомерКомпозиции) + "." + Номер;
			НС.КомплектКомпозицияНаименование 	= "   " + х.КомплектНаименование;
			Если х.ОсновнойЭтап = Перечисления.ОсновныеЭтапы.ПКД Тогда
				НС.КрайПроектирование 				= "";
				НС.КрайТЗ 							= "";
				НС.КрайСогласования 				= "";
			Иначе
				НС.КрайПроектирование 				= х.ВнешняяДатаОкончаниеПроектирования;
				НС.КрайТЗ 							= х.ВнешняяДатаОкончаниеТЗ;
				НС.КрайСогласования 				= х.ВнешняяДатаОкончаниеСогласования;
			КонецЕсли;
			
		Иначе	
			НС.Номер 							= Номер;
			НС.КомплектКомпозицияНаименование 	= х.КомплектНаименование;
			НС.КрайПроектирование 				= х.ВнешняяДатаОкончаниеПроектирования;
			НС.КрайТЗ 							= х.ВнешняяДатаОкончаниеТЗ;
			НС.КрайСогласования 				= х.ВнешняяДатаОкончаниеСогласования;
		КонецЕсли;
		
		НС.КомплектКомпозиция 				= х.ИзделиеКомплект;
		НС.Помещение 						= х.Помещение;                  
		//НС.ПомещениеНаименование		 	= х.ПомещениеНаименование + "/ " + х.ГабаритныйЧертежНаименование;
		НС.ПомещениеНаименование		 	= х.ПомещениеНаименование;
		НС.Приоритет 						= х.Приоритет;
		НС.Состояние		 				= х.ТекущаяСтадия;
		НС.КрайПроизводство 				= х.ВнешняяДатаОкончаниеПроизводства;
		НС.КрайМонтаж 						= х.ВнешняяДатаОкончаниеМонтажа;
		НС.КрайРКД 							= х.ВнешняяДатаОкончаниеРКД;
		НС.ОсновнойЭтап			 			= х.ОсновнойЭтап;
		НС.Редакция							= х.ПереходРедакцияКомпозиции;
		НС.ГабаритныйЧертеж					= х.ГабаритныйЧертеж;
		НС.ЭтоКомпозиция					= Ложь;
		
		//Если ЗначениеЗаполнено(х.ГабаритныйЧертеж) И мГабаритныеЧертежи.Найти(х.ГабаритныйЧертеж) = Неопределено Тогда
		//	мГабаритныеЧертежи.Добавить(х.ГабаритныйЧертеж);
		//КонецЕсли;
		//  

		Если НС.ОсновнойЭтап = Перечисления.ОсновныеЭтапы.ПКД И х.ПереходРедакция > 0 Тогда
			НС.Состояние = "Согласование." + (х.ПереходРедакция + 1);
			НС.Запас = Окр((НС.КрайСогласования - ТД) / КоличествоСекундВДне, 0);
		ИначеЕсли (НС.ОсновнойЭтап = Перечисления.ОсновныеЭтапы.ПКД 
			ИЛИ НС.ОсновнойЭтап = Перечисления.ОсновныеЭтапы.Согласование)  И ЗначениеЗаполнено(НС.КрайПроектирование) Тогда
			НС.Запас = Окр((НС.КрайПроектирование - ТД) / КоличествоСекундВДне, 0);
		ИначеЕсли НС.ОсновнойЭтап = Перечисления.ОсновныеЭтапы.РКД И ЗначениеЗаполнено(НС.КрайПроектирование) Тогда
			НС.Запас = Окр((НС.КрайПроектирование - ТД) / КоличествоСекундВДне, 0);
		ИначеЕсли НС.ОсновнойЭтап = Перечисления.ОсновныеЭтапы.Производство И ЗначениеЗаполнено(НС.КрайПроизводство) Тогда
			НС.Запас = Окр((НС.КрайПроизводство - ТД) / КоличествоСекундВДне, 0);
		Иначе
			НС.Запас = "";
		КонецЕсли;
		
		
		Номер = Номер + 1;
		
		мКомплект.Добавить(х.ИзделиеКомплект);
		мИзделиеКомплект.Добавить(х.ИзделиеКомплект);
		
	КонецЦикла;
	
	тзДанные.Индексы.Добавить("КомплектКомпозиция");    
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(ДанныеКомплекта.Период) КАК Период,
		|	ДанныеКомплекта.Комплект КАК Комплект
		|ИЗ
		|	РегистрСведений.ДанныеКомплекта КАК ДанныеКомплекта
		|ГДЕ
		|	ДанныеКомплекта.Комплект В(&Комплект)
		|	И ДанныеКомплекта.ТекущаяСтадия = &ТекущаяСтадия
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеКомплекта.Комплект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ПриложенияКДоговорамИзделияЗаказчика.Ссылка.ДатаДоговора) КАК ДатаДоговора,
		|	ИзделияКомплектИзделияЭлемент.Ссылка КАК Комплект
		|ИЗ
		|	Справочник.ПриложенияКДоговорам.ИзделияЗаказчика КАК ПриложенияКДоговорамИзделияЗаказчика
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИзделияЗаказчика.ИзделияЭлемент КАК ИзделияЗаказчикаИзделияЭлемент
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИзделияКомплект.ИзделияЭлемент КАК ИзделияКомплектИзделияЭлемент
		|			ПО ИзделияЗаказчикаИзделияЭлемент.ИзделиеЭлемент = ИзделияКомплектИзделияЭлемент.ИзделиеЭлемент
		|		ПО ПриложенияКДоговорамИзделияЗаказчика.ИзделиеЗаказчика = ИзделияЗаказчикаИзделияЭлемент.Ссылка
		|ГДЕ
		|	ИзделияКомплектИзделияЭлемент.Ссылка В(&Комплект)
		|
		|СГРУППИРОВАТЬ ПО
		|	ИзделияКомплектИзделияЭлемент.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИзделияКомплектИзделияЭлемент.Ссылка КАК Комплект,
		|	ИзделияЗаказчикаИзделияЭлемент.Ссылка.Наименование КАК ИзделияЗаказчикаНаименование
		|ИЗ
		|	Справочник.ИзделияКомплект.ИзделияЭлемент КАК ИзделияКомплектИзделияЭлемент
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИзделияЗаказчика.ИзделияЭлемент КАК ИзделияЗаказчикаИзделияЭлемент
		|		ПО ИзделияКомплектИзделияЭлемент.ИзделиеЭлемент = ИзделияЗаказчикаИзделияЭлемент.ИзделиеЭлемент
		|ГДЕ
		|	ИзделияКомплектИзделияЭлемент.Ссылка В(&мИзделиеКомплект)";
	
	Запрос.УстановитьПараметр("Комплект", 			мКомплект);
	Запрос.УстановитьПараметр("мИзделиеКомплект", 	мИзделиеКомплект);
	Запрос.УстановитьПараметр("ТекущаяСтадия", 		омНастройкаПовтор.ПолучитьСтадиюСогласовано());
	Результат = Запрос.ВыполнитьПакет();
	Выборка = Результат[0].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		тзДанные.Найти(Выборка.Комплект, "КомплектКомпозиция").Согласовано = Выборка.Период; 
		
	КонецЦикла;
	
	Выборка = Результат[1].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		тзДанные.Найти(Выборка.Комплект, "КомплектКомпозиция").Договор = Выборка.ДатаДоговора; 
	КонецЦикла;
	
	Выборка = Результат[2].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НайденаяСтрока = тзДанные.Найти(Выборка.Комплект, "КомплектКомпозиция");
		Если НЕ ПустаяСтрока(НайденаяСтрока.ИзделиеЗаказчика) Тогда
			НайденаяСтрока.ИзделиеЗаказчика = НайденаяСтрока.ИзделиеЗаказчика + ", ";
		КонецЕсли;
		НайденаяСтрока.ИзделиеЗаказчика = НайденаяСтрока.ИзделиеЗаказчика + Выборка.ИзделияЗаказчикаНаименование;
	КонецЦикла;
	
	//тзСтатусыЗамера = РегистрыСведений.СостояниеЗамера.ПолучитьСтатусыЗамера(мГабаритныеЧертежи);
	//
	//Для каждого текСтатусЗамера Из тзСтатусыЗамера Цикл
	//	
	//	НайденаяСтрока = тзДанные.Найти(текСтатусЗамера.ОбъектЗамера, "ГабаритныйЧертеж");
	//	
	//	НайденаяСтрока.СтатусПомещения = ПолучитьСтатусПроверки(текСтатусЗамера); 
	//
	//КонецЦикла;

	Возврат тзДанные;
	
КонецФункции 

Функция ПолучитьСтатусПроверки(текСтатусЗамера)

	Если текСтатусЗамера.СтатусЗамера = Перечисления.СтатусыЗамера.Проектный Тогда
		Возврат "Проектный";	
	КонецЕсли;
	
	СтатусЗамера = Строка(текСтатусЗамера.СтатусЗамера);
	
	Если НЕ текСтатусЗамера.Дата = Дата(1, 1, 1) Тогда
		СтатусЗамера = СтатусЗамера + " (" + Формат(текСтатусЗамера.Дата, "ДЛФ=DD") + ")";	
	КонецЕсли;
	
	
	Возврат СтатусЗамера;

КонецФункции // ПолучитьСтатусПроверки()

Функция ЗаполнитьКомплектыИзделий()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзделияКомплект.Ссылка КАК ИзделиеКомплект,
		|	ВЫБОР
		|		КОГДА ИзделияКомплект.Родитель.Композиция ЕСТЬ NULL
		|			ТОГДА """"
		|		ИНАЧЕ ИзделияКомплект.Родитель.Композиция.Наименование
		|	КОНЕЦ КАК КомпозицииНаименование,
		|	ВЫБОР
		|		КОГДА ИзделияКомплект.Родитель.Композиция ЕСТЬ NULL
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.Композиции.ПустаяСсылка)
		|		ИНАЧЕ ИзделияКомплект.Родитель.Композиция
		|	КОНЕЦ КАК Композиция,
		|	ВЫБОР
		|		КОГДА ИзделияКомплект.Родитель.Композиция ЕСТЬ NULL
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.Помещения.ПустаяСсылка)
		|		ИНАЧЕ ИзделияКомплект.Родитель.Композиция.ОсновноеПомещение
		|	КОНЕЦ КАК ПомещениеКомпозиции,
		|	ВЫБОР
		|		КОГДА ИзделияКомплект.Родитель.Композиция.ОсновноеПомещение ЕСТЬ NULL
		|			ТОГДА """"
		|		ИНАЧЕ ЕСТЬNULL(ИзделияКомплект.Родитель.Композиция.ОсновноеПомещение.Наименование, """")
		|	КОНЕЦ КАК ПомещениеКомпозицииНаименование,
		|	ИзделияКомплект.ОсновноеПомещение КАК Помещение,
		|	ВЫБОР
		|		КОГДА ИзделияКомплект.ОсновноеПомещение = ЗНАЧЕНИЕ(Справочник.Помещения.ПустаяСсылка)
		|			ТОГДА """"
		|		ИНАЧЕ ИзделияКомплект.ОсновноеПомещение.Наименование
		|	КОНЕЦ КАК ПомещениеНаименование,
		|	ИзделияКомплект.Наименование КАК КомплектНаименование,
		|	ДанныеКомплектаСрезПоследних.Приоритет КАК Приоритет,
		|	ДанныеКомплектаСрезПоследних.ТекущаяСтадия.ПолноеНаименование КАК ТекущаяСтадия,
		|	ДанныеКомплектаСрезПоследних1.Приоритет КАК ПриоритетКомпозиция,
		|	ДанныеКомплектаСрезПоследних1.ТекущаяСтадия.ПолноеНаименование КАК ТекущаяСтадияКомпозиция,
		|	ДанныеКомплектаСрезПоследних.ВнешняяДатаОкончаниеМонтажа КАК ВнешняяДатаОкончаниеМонтажа,
		|	ДанныеКомплектаСрезПоследних.ВнешняяДатаОкончаниеПроектирования КАК ВнешняяДатаОкончаниеПроектирования,
		|	ДанныеКомплектаСрезПоследних.ВнешняяДатаОкончаниеПроизводства КАК ВнешняяДатаОкончаниеПроизводства,
		|	ДанныеКомплектаСрезПоследних1.ВнешняяДатаОкончаниеПроектирования КАК ВнешняяДатаОкончаниеПроектированияКомпозиции,
		|	ДанныеКомплектаСрезПоследних.ТекущаяСтадия.ОсновнойЭтап КАК ОсновнойЭтап,
		|	ДанныеКомплектаСрезПоследних1.ТекущаяСтадия.ОсновнойЭтап КАК ОсновнойЭтапКомпозиции,
		|	ИзделияКомплект.ГабаритныйЧертеж КАК ГабаритныйЧертеж,
		|	ИзделияКомплект.Родитель.Композиция.ГабаритныйЧертеж КАК ГабаритныйЧертежКомпозиции,
		|	ЕСТЬNULL(ИзделияКомплект.ГабаритныйЧертеж, """") КАК ГабаритныйЧертежНаименование,
		|	ЕСТЬNULL(ИзделияКомплект.Родитель.Композиция.ГабаритныйЧертеж, """") КАК ГабаритныйЧертежКомпозицииНаименование,
		|	ДанныеКомплектаСрезПоследних.ВнешняяДатаОкончаниеТЗ КАК ВнешняяДатаОкончаниеТЗ,
		|	ДанныеКомплектаСрезПоследних.ВнешняяДатаОкончаниеСогласования КАК ВнешняяДатаОкончаниеСогласования,
		|	ДанныеКомплектаСрезПоследних1.ВнешняяДатаОкончаниеТЗ КАК ВнешняяДатаОкончаниеТЗКомпозиции,
		|	ДанныеКомплектаСрезПоследних1.ВнешняяДатаОкончаниеСогласования КАК ВнешняяДатаОкончаниеСогласованияКомпозиции,
		|	ДанныеКомплектаСрезПоследних.ВнешняяДатаОкончаниеРКД КАК ВнешняяДатаОкончаниеРКД,
		|	ДатыКомплекта.ПереходРедакция КАК ПереходРедакция,
		|	ДатыКомплекта1.ПереходРедакция КАК ПереходРедакцияКомпозиции,
		|	ИзделияКомплект.Проект КАК Проект,
		|	ИзделияКомплект.Проект.Номер КАК ПроектНомер,
		|	ИзделияКомплект.Проект.Наименование КАК ПроектНаименование
		|ИЗ
		|	Справочник.ИзделияКомплект КАК ИзделияКомплект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКомплекта.СрезПоследних КАК ДанныеКомплектаСрезПоследних
		|		ПО (ДанныеКомплектаСрезПоследних.Комплект = ИзделияКомплект.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКомплекта.СрезПоследних КАК ДанныеКомплектаСрезПоследних1
		|		ПО (ДанныеКомплектаСрезПоследних1.Комплект = ИзделияКомплект.Родитель.Композиция)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыКомплекта КАК ДатыКомплекта
		|		ПО (ДатыКомплекта.Комплект = ИзделияКомплект.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыКомплекта КАК ДатыКомплекта1
		|		ПО (ДатыКомплекта1.Комплект = ИзделияКомплект.Родитель.Композиция)
		|ГДЕ
		|	ИзделияКомплект.Проект В(&Проекты)
		|	И НЕ ИзделияКомплект.ЭтоГруппа
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПроектНомер,
		|	КомпозицииНаименование,
		|	КомплектНаименование";
	
	Запрос.УстановитьПараметр("Проекты", Проекты);
	
	Возврат Запрос.Выполнить().Выгрузить();
	

КонецФункции // ЗаполнитьКомплектыИзделий()

Процедура ВывестиДанные(стТаблицы)

	
	ПустаяДата = Дата(1,1,1);
	
	Таб = ПолеВывода;
	Таб.Очистить();
	
	Макет = Отчеты.СостояниеПроекта.ПолучитьМакет("Макет");
	
	Таб.Вывести(Макет.ПолучитьОбласть("Шапка"));
	Таб.ФиксацияСверху 	= Таб.ВысотаТаблицы; 
	Таб.ФиксацияСлева	= 3;
	
    обСтрока 		= Макет.ПолучитьОбласть("Строка"); 
    обКомпозиция 	= Макет.ПолучитьОбласть("Композиция"); 
    обПроект 	 	= Макет.ПолучитьОбласть("Проект"); 
	
	Для каждого текСтрока Из стТаблицы.тзДанные Цикл
		
		Если ЗначениеЗаполнено(текСтрока.ПроектНаименование) Тогда
			текОбласть = обПроект; 
		Иначе
			текОбласть = ?(текСтрока.ЭтоКомпозиция, обКомпозиция, обСтрока); 
		КонецЕсли;
		
		текОбласть.Параметры.Заполнить(текСтрока); 
		
		Таб.Вывести(текОбласть);
	КонецЦикла; 
	
КонецПроцедуры // ВывестиДанные()

&НаСервереБезКонтекста
Функция ЗаполнитьПроектыНаСервере(мДобавленныеПроекты)

	СписокПроектов = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Проекты.Ссылка КАК Значение,
		|	Проекты.Наименование КАК Представление,
		|	Проекты.Номер КАК Номер
		|ИЗ
		|	Справочник.Проекты КАК Проекты
		|ГДЕ
		|	НЕ Проекты.Ссылка В (&мДобавленныеПроекты)
		|	И НЕ Проекты.НеВыводитьНаДиаграмму
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номер";
	
	Запрос.УстановитьПараметр("мДобавленныеПроекты", мДобавленныеПроекты);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СписокПроектов.Добавить(Выборка.Значение, Строка(Выборка.Номер) + " " + Выборка.Представление);
	КонецЦикла;
	
	Возврат СписокПроектов;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьПроекты(Команда)
	
	Для каждого ТекущийПроект Из ЗаполнитьПроектыНаСервере(Проекты.ВыгрузитьЗначения()) Цикл
		Проекты.Добавить(ТекущийПроект.Значение, ТекущийПроект.Представление);
	КонецЦикла;
	
КонецПроцедуры
